Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxSrc_reg.h
/** \brief 528, DMA Channel  110 Service Request */
#define SRC_DMA_DMA0_CH110 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038528u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH110.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH110.
*/
#define SRC_DMACH110 (SRC_DMA_DMA0_CH110)

/** \brief 52C, DMA Channel  111 Service Request */
#define SRC_DMA_DMA0_CH111 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003852Cu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH111.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH111.
*/
#define SRC_DMACH111 (SRC_DMA_DMA0_CH111)

/** \brief 530, DMA Channel  112 Service Request */
#define SRC_DMA_DMA0_CH112 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038530u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH112.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH112.
*/
#define SRC_DMACH112 (SRC_DMA_DMA0_CH112)

/** \brief 534, DMA Channel  113 Service Request */
#define SRC_DMA_DMA0_CH113 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038534u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH113.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH113.
*/
#define SRC_DMACH113 (SRC_DMA_DMA0_CH113)

/** \brief 538, DMA Channel  114 Service Request */
#define SRC_DMA_DMA0_CH114 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038538u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH114.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH114.
*/
#define SRC_DMACH114 (SRC_DMA_DMA0_CH114)

/** \brief 53C, DMA Channel  115 Service Request */
#define SRC_DMA_DMA0_CH115 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003853Cu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH115.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH115.
*/
#define SRC_DMACH115 (SRC_DMA_DMA0_CH115)

/** \brief 540, DMA Channel  116 Service Request */
#define SRC_DMA_DMA0_CH116 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038540u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH116.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH116.
*/
#define SRC_DMACH116 (SRC_DMA_DMA0_CH116)

/** \brief 544, DMA Channel  117 Service Request */
#define SRC_DMA_DMA0_CH117 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038544u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH117.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH117.
*/
#define SRC_DMACH117 (SRC_DMA_DMA0_CH117)

/** \brief 548, DMA Channel  118 Service Request */
#define SRC_DMA_DMA0_CH118 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038548u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH118.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH118.
*/
#define SRC_DMACH118 (SRC_DMA_DMA0_CH118)

/** \brief 54C, DMA Channel  119 Service Request */
#define SRC_DMA_DMA0_CH119 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003854Cu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH119.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH119.
*/
#define SRC_DMACH119 (SRC_DMA_DMA0_CH119)

/** \brief 550, DMA Channel  120 Service Request */
#define SRC_DMA_DMA0_CH120 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038550u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH120.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH120.
*/
#define SRC_DMACH120 (SRC_DMA_DMA0_CH120)

/** \brief 554, DMA Channel  121 Service Request */
#define SRC_DMA_DMA0_CH121 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038554u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH121.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH121.
*/
#define SRC_DMACH121 (SRC_DMA_DMA0_CH121)

/** \brief 558, DMA Channel  122 Service Request */
#define SRC_DMA_DMA0_CH122 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038558u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH122.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH122.
*/
#define SRC_DMACH122 (SRC_DMA_DMA0_CH122)

/** \brief 55C, DMA Channel  123 Service Request */
#define SRC_DMA_DMA0_CH123 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003855Cu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH123.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH123.
*/
#define SRC_DMACH123 (SRC_DMA_DMA0_CH123)

/** \brief 560, DMA Channel  124 Service Request */
#define SRC_DMA_DMA0_CH124 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038560u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH124.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH124.
*/
#define SRC_DMACH124 (SRC_DMA_DMA0_CH124)

/** \brief 564, DMA Channel  125 Service Request */
#define SRC_DMA_DMA0_CH125 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038564u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH125.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH125.
*/
#define SRC_DMACH125 (SRC_DMA_DMA0_CH125)

/** \brief 568, DMA Channel  126 Service Request */
#define SRC_DMA_DMA0_CH126 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038568u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH126.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH126.
*/
#define SRC_DMACH126 (SRC_DMA_DMA0_CH126)

/** \brief 56C, DMA Channel  127 Service Request */
#define SRC_DMA_DMA0_CH127 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003856Cu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH127.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH127.
*/
#define SRC_DMACH127 (SRC_DMA_DMA0_CH127)

/** \brief 580, GETH Service Request 0 */
#define SRC_GETH_GETH0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038580u)
/** Alias (User Manual Name) for SRC_GETH_GETH0_SR0.
* To use register names with standard convension, please use SRC_GETH_GETH0_SR0.
*/
#define SRC_GETH0 (SRC_GETH_GETH0_SR0)

/** \brief 584, GETH Service Request 1 */
#define SRC_GETH_GETH0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038584u)
/** Alias (User Manual Name) for SRC_GETH_GETH0_SR1.
* To use register names with standard convension, please use SRC_GETH_GETH0_SR1.
*/
#define SRC_GETH1 (SRC_GETH_GETH0_SR1)

/** \brief 588, GETH Service Request 2 */
#define SRC_GETH_GETH0_SR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038588u)
/** Alias (User Manual Name) for SRC_GETH_GETH0_SR2.
* To use register names with standard convension, please use SRC_GETH_GETH0_SR2.
*/
#define SRC_GETH2 (SRC_GETH_GETH0_SR2)

/** \brief 58C, GETH Service Request 3 */
#define SRC_GETH_GETH0_SR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003858Cu)
/** Alias (User Manual Name) for SRC_GETH_GETH0_SR3.
* To use register names with standard convension, please use SRC_GETH_GETH0_SR3.
*/
#define SRC_GETH3 (SRC_GETH_GETH0_SR3)

/** \brief 590, GETH Service Request 4 */
#define SRC_GETH_GETH0_SR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038590u)
/** Alias (User Manual Name) for SRC_GETH_GETH0_SR4.
* To use register names with standard convension, please use SRC_GETH_GETH0_SR4.
*/
#define SRC_GETH4 (SRC_GETH_GETH0_SR4)

/** \brief 594, GETH Service Request 5 */
#define SRC_GETH_GETH0_SR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038594u)
/** Alias (User Manual Name) for SRC_GETH_GETH0_SR5.
* To use register names with standard convension, please use SRC_GETH_GETH0_SR5.
*/
#define SRC_GETH5 (SRC_GETH_GETH0_SR5)

