Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxSrc_reg.h
/** \brief D08, MCS2 Shared Service Request 6 */
#define SRC_GTM_MCS2_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D08u)
/** Alias (User Manual Name) for SRC_GTM_MCS2_6.
* To use register names with standard convension, please use SRC_GTM_MCS2_6.
*/
#define SRC_GTMMCS26 (SRC_GTM_MCS2_6)

/** \brief D0C, MCS2 Shared Service Request 7 */
#define SRC_GTM_MCS2_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D0Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS2_7.
* To use register names with standard convension, please use SRC_GTM_MCS2_7.
*/
#define SRC_GTMMCS27 (SRC_GTM_MCS2_7)

/** \brief D10, MCS3 Shared Service Request 0 */
#define SRC_GTM_MCS3_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D10u)
/** Alias (User Manual Name) for SRC_GTM_MCS3_0.
* To use register names with standard convension, please use SRC_GTM_MCS3_0.
*/
#define SRC_GTMMCS30 (SRC_GTM_MCS3_0)

/** \brief D14, MCS3 Shared Service Request 1 */
#define SRC_GTM_MCS3_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D14u)
/** Alias (User Manual Name) for SRC_GTM_MCS3_1.
* To use register names with standard convension, please use SRC_GTM_MCS3_1.
*/
#define SRC_GTMMCS31 (SRC_GTM_MCS3_1)

/** \brief D18, MCS3 Shared Service Request 2 */
#define SRC_GTM_MCS3_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D18u)
/** Alias (User Manual Name) for SRC_GTM_MCS3_2.
* To use register names with standard convension, please use SRC_GTM_MCS3_2.
*/
#define SRC_GTMMCS32 (SRC_GTM_MCS3_2)

/** \brief D1C, MCS3 Shared Service Request 3 */
#define SRC_GTM_MCS3_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D1Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS3_3.
* To use register names with standard convension, please use SRC_GTM_MCS3_3.
*/
#define SRC_GTMMCS33 (SRC_GTM_MCS3_3)

/** \brief D20, MCS3 Shared Service Request 4 */
#define SRC_GTM_MCS3_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D20u)
/** Alias (User Manual Name) for SRC_GTM_MCS3_4.
* To use register names with standard convension, please use SRC_GTM_MCS3_4.
*/
#define SRC_GTMMCS34 (SRC_GTM_MCS3_4)

/** \brief D24, MCS3 Shared Service Request 5 */
#define SRC_GTM_MCS3_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D24u)
/** Alias (User Manual Name) for SRC_GTM_MCS3_5.
* To use register names with standard convension, please use SRC_GTM_MCS3_5.
*/
#define SRC_GTMMCS35 (SRC_GTM_MCS3_5)

/** \brief D28, MCS3 Shared Service Request 6 */
#define SRC_GTM_MCS3_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D28u)
/** Alias (User Manual Name) for SRC_GTM_MCS3_6.
* To use register names with standard convension, please use SRC_GTM_MCS3_6.
*/
#define SRC_GTMMCS36 (SRC_GTM_MCS3_6)

/** \brief D2C, MCS3 Shared Service Request 7 */
#define SRC_GTM_MCS3_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D2Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS3_7.
* To use register names with standard convension, please use SRC_GTM_MCS3_7.
*/
#define SRC_GTMMCS37 (SRC_GTM_MCS3_7)

/** \brief D30, MCS4 Shared Service Request 0 */
#define SRC_GTM_MCS4_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D30u)
/** Alias (User Manual Name) for SRC_GTM_MCS4_0.
* To use register names with standard convension, please use SRC_GTM_MCS4_0.
*/
#define SRC_GTMMCS40 (SRC_GTM_MCS4_0)

/** \brief D34, MCS4 Shared Service Request 1 */
#define SRC_GTM_MCS4_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D34u)
/** Alias (User Manual Name) for SRC_GTM_MCS4_1.
* To use register names with standard convension, please use SRC_GTM_MCS4_1.
*/
#define SRC_GTMMCS41 (SRC_GTM_MCS4_1)

/** \brief D38, MCS4 Shared Service Request 2 */
#define SRC_GTM_MCS4_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D38u)
/** Alias (User Manual Name) for SRC_GTM_MCS4_2.
* To use register names with standard convension, please use SRC_GTM_MCS4_2.
*/
#define SRC_GTMMCS42 (SRC_GTM_MCS4_2)

/** \brief D3C, MCS4 Shared Service Request 3 */
#define SRC_GTM_MCS4_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D3Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS4_3.
* To use register names with standard convension, please use SRC_GTM_MCS4_3.
*/
#define SRC_GTMMCS43 (SRC_GTM_MCS4_3)

/** \brief D40, MCS4 Shared Service Request 4 */
#define SRC_GTM_MCS4_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D40u)
/** Alias (User Manual Name) for SRC_GTM_MCS4_4.
* To use register names with standard convension, please use SRC_GTM_MCS4_4.
*/
#define SRC_GTMMCS44 (SRC_GTM_MCS4_4)

/** \brief D44, MCS4 Shared Service Request 5 */
#define SRC_GTM_MCS4_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D44u)
/** Alias (User Manual Name) for SRC_GTM_MCS4_5.
* To use register names with standard convension, please use SRC_GTM_MCS4_5.
*/
#define SRC_GTMMCS45 (SRC_GTM_MCS4_5)

/** \brief D48, MCS4 Shared Service Request 6 */
#define SRC_GTM_MCS4_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D48u)
/** Alias (User Manual Name) for SRC_GTM_MCS4_6.
* To use register names with standard convension, please use SRC_GTM_MCS4_6.
*/
#define SRC_GTMMCS46 (SRC_GTM_MCS4_6)

/** \brief D4C, MCS4 Shared Service Request 7 */
#define SRC_GTM_MCS4_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D4Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS4_7.
* To use register names with standard convension, please use SRC_GTM_MCS4_7.
*/
#define SRC_GTMMCS47 (SRC_GTM_MCS4_7)

/** \brief E10, TOM0 Shared Service Request 0 */
#define SRC_GTM_TOM0_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E10u)
/** Alias (User Manual Name) for SRC_GTM_TOM0_0.
* To use register names with standard convension, please use SRC_GTM_TOM0_0.
*/
#define SRC_GTMTOM00 (SRC_GTM_TOM0_0)

/** \brief E14, TOM0 Shared Service Request 1 */
#define SRC_GTM_TOM0_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E14u)
/** Alias (User Manual Name) for SRC_GTM_TOM0_1.
* To use register names with standard convension, please use SRC_GTM_TOM0_1.
*/
#define SRC_GTMTOM01 (SRC_GTM_TOM0_1)

/** \brief E18, TOM0 Shared Service Request 2 */
#define SRC_GTM_TOM0_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E18u)
/** Alias (User Manual Name) for SRC_GTM_TOM0_2.
* To use register names with standard convension, please use SRC_GTM_TOM0_2.
*/
#define SRC_GTMTOM02 (SRC_GTM_TOM0_2)

